<!DOCTYPE html><html><head><meta charset="utf-8"><meta name="viewport" content="width=device-width, initial-scale=1"><style>body {
  max-width: 980px;
  margin: 16px auto;
}

body .markdown-body
{
  padding: 45px;
}

@font-face {
  font-family: fontawesome-mini;

<p>We know that the size of the slab of filp kmem cache is two pages on Android, and the size of the user page table is one page. Although the size of the victim slab and user page table is unequal, we still get a big chance to occupy the victim slab with the user page tables by heap spray. In practice, the success rate of occupation is almost 100%. After the occupation, the layout of the victim file object and user page table is supposed to be like this:
<center>
<img alt="figure15" height="50%" src="./assets3/pic2_occupy_slab_with_pagetable.svg" title="figure15" width="50%" />
</center>
<center>Figure 15</center></p>
<p>As you can see, the victim file object locates in the user page table.</p>
<h4 id="424-construct-the-increment-primitive-and-locate-the-virtual-user-address-corresponding-to-the-victim-pte">4.2.4 Construct the increment primitive and locate the virtual user address corresponding to the victim PTE<a class="headerlink" href="#424-construct-the-increment-primitive-and-locate-the-virtual-user-address-corresponding-to-the-victim-pte" title="Permanent link"></a></h4>
<p>Although we make the victim file object located in the user page table, we can perform very limited operations on the victim file object because it&rsquo;s an illegal file object. Most operations on the victim file object would trigger illegal memory access, and kernel panic would happen. After a long time of searching, I found that the <code>f_count</code> field of the file object can be incremented by one many times with dup() without triggering a kernel panic. Because the dup() consumes fd resources and a single process can only generate 32768 fd at most, we can only add 32768 to <code>f_count</code> at most in a process. This is just not enough(You will know the reason later). So I kept on looking, and it turns out that fork()+dup() would help us break the limitation. We can call fork() first, which will add 1 to the <code>f_count</code> of the victim file object, and then in the child process, we can add 32768 to <code>f_count</code>. Because we can repeat fork()+dup() many times, so we succeed in breaking the limitation. Although there is still a limitation for the increment times, it won&rsquo;t bother us that much.</p>
<p>We now have an increment primitive for the <code>f_count</code> of the victim file object. Our next step is obvious: let the position of the victim PTE coincide with the <code>f_count</code>, then we can perform the increment primitive to the victim PTE and control it to some extent.</p>
<p>The aligned size of a file object is 320 bytes, the offset of <code>f_count</code> is 56, and the size of <code>f_count</code> is 8 bytes:
<div class="highlight"><pre><span class="p">(</span><span class="n">gdb</span><span class="p">)</span> <span class="n">ptype</span> <span class="o">/</span><span class="n">o</span> <span class="k">struct</span> <span class="n">file</span>
<span class="cm">/* offset      |    size */</span>  <span class="n">type</span> <span class="o">=</span> <span class="k">struct</span> <span class="n">file</span> <span class="p">{</span>
<span class="cm">/*      0      |      16 */</span>    <span class="k">union</span> <span class="p">{</span>
<span class="cm">/*                     8 */</span>        <span class="k">struct</span> <span class="n">llist_node</span> <span class="p">{</span>
<span class="cm">/*      0      |       8 */</span>            <span class="k">struct</span> <span class="n">llist_node</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>

                                       <span class="cm">/* total size (bytes):    8 */</span>
                                   <span class="p">}</span> <span class="n">fu_llist</span><span class="p">;</span>
<span class="cm">/*                    16 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
<span class="cm">/*      0      |       8 */</span>            <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
<span class="cm">/*      8      |       8 */</span>            <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>

                                       <span class="cm">/* total size (bytes):   16 */</span>
                                   <span class="p">}</span> <span class="n">fu_rcuhead</span><span class="p">;</span>

                                   <span class="cm">/* total size (bytes):   16 */</span>
                               <span class="p">}</span> <span class="n">f_u</span><span class="p">;</span>
<span class="cm">/*     16      |      16 */</span>    <span class="k">struct</span> <span class="n">path</span> <span class="p">{</span>
<span class="cm">/*     16      |       8 */</span>        <span class="k">struct</span> <span class="n">vfsmount</span> <span class="o">*</span><span class="n">mnt</span><span class="p">;</span>
<span class="cm">/*     24      |       8 */</span>        <span class="k">struct</span> <span class="n">dentry</span> <span class="o">*</span><span class="n">dentry</span><span class="p">;</span>

                                   <span class="cm">/* total size (bytes):   16 */</span>
                               <span class="p">}</span> <span class="n">f_path</span><span class="p">;</span>
<span class="cm">/*     32      |       8 */</span>    <span class="k">struct</span> <span class="n">inode</span> <span class="o">*</span><span class="n">f_inode</span><span class="p">;</span>
<span class="cm">/*     40      |       8 */</span>    <span class="k">const</span> <span class="k">struct</span> <span class="n">file_operations</span> <span class="o">*</span><span class="n">f_op</span><span class="p">;</span>
<span class="cm">/*     48      |       4 */</span>    <span class="kt">spinlock_t</span> <span class="n">f_lock</span><span class="p">;</span>
<span class="cm">/*     52      |       4 */</span>    <span class="k">enum</span> <span class="n">rw_hint</span> <span class="n">f_write_hint</span><span class="p">;</span>
<span class="cm">/*     56      |       8 */</span>    <span class="kt">atomic_long_t</span> <span class="n">f_count</span><span class="p">;</span>
<span class="cm">/*     64      |       4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">f_flags</span><span class="p">;</span>
<span class="p">......</span>
<span class="p">......</span>
<span class="cm">/*    288      |       8 */</span>    <span class="n">u64</span> <span class="n">android_oem_data1</span><span class="p">;</span>

                               <span class="cm">/* total size (bytes):  296 */</span>
                             <span class="p">}</span>
</pre></div>
The size of the slab of filp kmem cache is two pages, and there are 25 file objects in a slab of filp kmem cache; the layout of a slab is like this:
<center>
<img alt="figure16" height="80%" src="./assets3/pic3_slab_layout_of_filp.svg" title="figure16" width="80%" />
</center>
<center>Figure 16</center></p>
<p>Because there are 25 possible positions for the victim file object, to ensure that the <code>f_count</code> of the victim file object and the victim PTE are coincident in position, we have to prepare every user page table like this:</p>
<p><center>
<img alt="figure17" height="40%" src="./assets3/pic4_pagetable_layout.svg" title="figure17" width="40%" />
</center>
<center>Figure 17</center></p>
